{
  "radio": "Przekazuj dane za pomocą pakietów radiowych",
  "radio.Packet.receivedBuffer": "Payload bufora, jeśli w tym pakiecie wysłano bufor lub pusty bufor",
  "radio.Packet.receivedNumber": "Użyteczny ładunek liczbowy, jeśli w tym pakiecie wysłano liczbę (przez ``sendNumber()`` lub ``sendValue()``)\nlub 0, jeśli pakiet nie zawierał liczby.",
  "radio.Packet.receivedString": "Użyteczny ładunek ciągu, jeśli w tym pakiecie wysłano ciąg (via ``sendString()`` or ``sendValue()``)\nlub pusty ciąg, jeśli ten pakiet nie zawierał ciągu.",
  "radio.Packet.serial": "Numer seryjny nadawcy pakietu lub 0, jeśli nadawca nie wysyłał swojego numeru seryjnego.",
  "radio.Packet.signal": "Wskaźnik siły odbieranego sygnału (RSSI) pakietu.",
  "radio.Packet.time": "Czas systemowy nadawcy pakietu w czasie wysłania pakietu.",
  "radio.onDataReceived": "Rejestruje kod, który ma się uruchomić, gdy pakiet jest otrzymany za pośrednictwem radia.",
  "radio.receiveNumber": "Odczytuje następny pakiet z kolejki radiowej i zwraca istotny fragment numeru pakietu lub 0, jeśli pakiet nie zawiera numeru.",
  "radio.receiveString": "Odczytuje następny pakiet z kolejki radiowej i zwraca istotny fragment łańcucha znaków pakietu lub pusty łańcuch, jeśli pakiet nie zawiera łańcucha.",
  "radio.receivedBuffer": "Zwraca payload bufora z ostatnie pakietu wziętego z kolejki radiowej (przez ``receiveNumber``, ``receiveString`` itd.) lub pusty ciąg, jeśli ten pakiet nie zawierał ciągu.",
  "radio.receivedSignalStrength": "Pobiera wskaźnik siły odbieranego sygnału (RSSI) z ostatnich pobranych pakietów z kolejki radiowej (za pośrednictwem '' receiveNumber'', '' receiveString'' itd.). Nieobsługiwane w symulatorze.\nPrzestrzeń nazw = radio",
  "radio.sendBuffer": "Nadaje bufor (do 19 bajtów długości) wraz z seryjnym numerem urządzenia i czasem działania do każdego podłączonego micro:bit w grupie.",
  "radio.sendNumber": "Nadaje liczbę przez radio do każdego podłączonego micro:bit w grupie.",
  "radio.sendString": "Nadaje łańcuch znaków wraz z numerem seryjnym urządzenia i czas trwania do każdego połączonego micro:bit w grupie.",
  "radio.sendValue": "Nadaje nazwę/wartość pary wraz z numerem seryjnym urządzenia i czas trwania do każdego połączonego micro:bit w grupie.",
  "radio.sendValue|param|name": "pole nazwy (maks 12 znaków), np: \"nazwa\"",
  "radio.sendValue|param|value": "wartość numeryczna",
  "radio.setGroup": "Ustawia identyfikator grupy dla łączności radiowej. Micro:bit może obierać tylko jedną grupę o danym ID w dowolnym momencie.",
  "radio.setGroup|param|id": "identyfikator grupy między '' 0'' i '' 255'', np.: 1",
  "radio.setTransmitPower": "Zmień poziom zasilania wyjścia nadajnika do danej wartości.",
  "radio.setTransmitPower|param|power": "wartość w zakresie 0..7, gdzie 0 jest najniższą mocą a 7 jest najwyższą. np: 7",
  "radio.setTransmitSerialNumber": "Ustaw radio na nadawanie numeru seryjnego w każdej wiadomości.",
  "radio.setTransmitSerialNumber|param|transmit": "wartość wskazująca, czy numer seryjny jest transmitowany, np. \"prawda\"",
  "radio.writeReceivedPacketToSerial": "Zapisuje ostatni otrzymany pakiet do numeru seryjnego jako JSON. Należy go wywoływać w ramach wywołania zwrotnego ``onDataPacketReceived``.",
  "radio.writeValueToSerial": "Odczytuje następny pakiet z kolejki radiowej i zapisuje go do numeru seryjnego jako JSON."
}