{
  "radio": "Comunica dati utilizzando i pacchetti radio",
  "radio.Packet.receivedNumber": "Il numero contenuto, se è stato inviato un numero in questo pacchetto (attraverso ``sendNumber()`` o ``sendValue()``)\noppure 0 se questo pacchetto non contiene un numero.",
  "radio.Packet.receivedString": "La stringa contenuta, se è stata inviata una stringa in questo pacchetto (attraverso ``sendString()`` o ``sendValue()``)\noppure una stringa vuota se questo pacchetto non contiene una stringa.",
  "radio.Packet.serial": "Il numero di serie del mittente del pacchetto oppure 0 se il mittente non ha inviato il suo numero di serie.",
  "radio.Packet.signal": "L'indicatore di potenza del segnale ricevuto (RSSI) del pacchetto.",
  "radio.Packet.time": "L'ora di sistema del mittente del pacchetto al momento in cui è stato inviato il pacchetto.",
  "radio.onDataPacketReceived": "Registra il codice da eseguire quando si riceve un pacchetto via radio. Viene anche gestita una coda di pacchetti in arrivo.",
  "radio.onDataReceived": "Registra il codice da eseguire quando viene ricevuto un pacchetto via radio.",
  "radio.receiveNumber": "Legge il pacchetto successivo dalla coda radio e restituisce il numero contenuto\nnel pacchetto o 0 se il pacchetto non contiene un numero.",
  "radio.receiveString": "Legge il pacchetto successivo dalla coda radio e restituisce la stringa contenuta\nnel pacchetto o 0 se il pacchetto non contiene un numero.",
  "radio.receivedSignalStrength": "Riceve l'indicatore di potenza del segnale in ricezione (RSSI) dall'ultimo pacchetto\nestratto dalla coda radio (via ``receiveNumber``, ``receiveString``, ecc). Non supportato nel simulatore.\nnamespace=radio",
  "radio.sendNumber": "Invia un numero a tutti i micro:bit del gruppo connessi via radio.",
  "radio.sendString": "Invia una stringa insieme al numero di serie del dispositivo ed al periodo di funzionamento (ms) a tutti i micro:bit del gruppo connessi via radio.",
  "radio.sendValue": "Invia una coppia nome / valore insieme al numero di serie del dispositivo ed al periodo di funzionamento (ms) a tutti i micro:bit del gruppo connessi via radio.",
  "radio.sendValue|param|name": "il nome del campo (max 12 caratteri), es.: \"nome\"",
  "radio.sendValue|param|value": "il valore numerico",
  "radio.setGroup": "Imposta il codice di gruppo per le comunicazioni via radio. Un micro:bit può ricevere da un unico gruppo alla volta.",
  "radio.setGroup|param|id": "l'id di gruppo, compreso tra ``0`` e ``255``, es.: 1",
  "radio.setTransmitPower": "Cambia la potenza di uscita del trasmettitore al valore indicato.",
  "radio.setTransmitPower|param|power": "un valore nell'intervallo 0-7, dove 0 è la potenza più bassa e 7 la più alta, es.: 7",
  "radio.setTransmitSerialNumber": "Imposta la radio per trasmettere sempre il numero di serie in ogni messaggio.",
  "radio.setTransmitSerialNumber|param|transmit": "valore che indica se il numero seriale viene trasmesso, es.: true",
  "radio.writeReceivedPacketToSerial": "Scrivi l'ultimo pacchetto ricevuto su seriale in formato JSON. Questo dovrebbe essere richiamato dalla funzione ``onDataPacketReceived``.",
  "radio.writeValueToSerial": "Legge il pacchetto successivo dalla coda radio e lo serializza come\nJSON."
}