{
  "radio": "Adatok továbbítása rádiócsomagok használatával",
  "radio.Packet.receivedNumber": "A szám - hasznos teher, ha számot ebben a csomagban küldték (a \"sendNumber()''-en vagy ''sendValue()''-n keresztül), vagy 0, ha ez a csomag nem tartalmazott egy számot.",
  "radio.Packet.receivedString": "A karakterlánc - hasznos teher, ha a karakterláncot ebben a csomagban küldték (\"sendString()\"-en vagy \"sendValue()\"-n keresztül), vagy 0, ha ez a csomag nem tartalmazott egy karakterláncot.",
  "radio.Packet.serial": "A csomag feladójának sorszáma, vagy 0, ha a feladó nem küldte el sorszámát.",
  "radio.Packet.signal": "A csomag vételi jelének térerő mutatója (RSSI).",
  "radio.Packet.time": "A csomag feladójának rendszerideje a csomag küldésének időpontjában.",
  "radio.onDataReceived": "Eltárolja azt a kódot, amelyet egy rádión keresztül érkezett csomag esetén kell futtatni.",
  "radio.receiveNumber": "Beolvassa a következő csomagot a rádió sorból, és visszaadja a csomagban található számot, vagy pedig 0-t, ha a csomagban nem volt szám.",
  "radio.receiveString": "Beolvassa a következő csomagot a rádió sorból, és visszaadja a csomagban található karakterláncot, vagy pedig 0-t, ha a csomagban nem volt karakterlánc.",
  "radio.receivedNumber": "A rádió várólistából ('' receiveNumber'', '' receiveString'', stb. segítségélvel) vett utolsó csomagból megadja a hasznos teherként érkezett számot, vagy az értéke 0, ha a csomag nem tartalmaz egy számot.",
  "radio.receivedSignalStrength": "A rádió várólistából kapott utolsó csomagból (ezeken keresztül: '' receiveNumber'', '' receiveString'', stb) lehozza a térerő mutatót (RSSI). A szimulátor nem támogatja.\nnévtér = rádió",
  "radio.sendNumber": "Egy számot közvetítr rádión a csoportból bármely csatlakoztatott mikro: bit felé.",
  "radio.sendString": "Karakterláncot közvetít az eszköz sorszámával és a csoport bármely csatlakoztatott mikro:bit-jéhez a futásidővel.",
  "radio.sendValue": "Név / érték párt közvetít az eszköz sorszámával és a csoport bármely csatlakoztatott mikro:bit-jéhez a futásidővel együtt.",
  "radio.sendValue|param|name": "a mező neve (max 12 karakter), pl.: \"név\"",
  "radio.sendValue|param|value": "a numerikus érték",
  "radio.setGroup": "Csoportazonosítót állít be a rádiófrekvenciás hírközléshez. Egy mikro:bit bármikor csak egy csoport-azonosítót hallgathat.",
  "radio.setGroup|param|id": "csoportazonosító '' 0'' és '' 255'' között, pl.: 1",
  "radio.setTransmitPower": "Az adó kimeneti teljesítmény szintjének módosítása a megadott értékre.",
  "radio.setTransmitPower|param|power": "egy érték a 0..7 tartományban, ahol 0 a legalacsonyabb és 7 a legmagasabb teljesítmény. pl.: 7",
  "radio.setTransmitSerialNumber": "Beállítja a rádiót, hogy minden üzenetben a sorszámot továbbítsa.",
  "radio.setTransmitSerialNumber|param|transmit": "érték, amely jelzi sorszám adását, pl.: igaz",
  "radio.writeReceivedPacketToSerial": "JSON-ként beírja a sorban kapott utolsó csomagot. Ezt az ''onDataPacketReceived'' visszahíváson belül kell hívni.",
  "radio.writeValueToSerial": "Beolvassa a következő csomagot a rádió-várólistából és JSON-ként kiírja sorozatba."
}