{
  "radio": "Обмен данными с помощью радиопакетов",
  "radio.Packet.receivedBuffer": "Полезные данные буфера, если в этом пакете был отправлен\nбуфер, или пустой буфер",
  "radio.Packet.receivedNumber": "Числовые полезные данные, если в этом пакете было отправлено число (через «sendNumber()» или «sendValue()»),\nили 0, если пакет не содержит числа.",
  "radio.Packet.receivedString": "Строковые полезные данные, если в этом пакете была отправлена строка (через «sendString()» или «sendValue()»),\nили пустая строка, если пакет не содержит строки.",
  "radio.Packet.serial": "Серийный номер отправителя пакета или 0, если отправитель не передал свой серийный номер.",
  "radio.Packet.signal": "Индикатор уровня принимаемого сигнала (RSSI) для пакета.",
  "radio.Packet.time": "Системное время отправителя пакета в момент отправки пакета.",
  "radio.onDataReceived": "Регистрирует код, который запускается, когда по радиоканалу принимается пакет.",
  "radio.receiveNumber": "Читает следующий пакет из очереди радиоканала и возвращает числовые полезные данные\nпакета или 0, если пакет не содержит числа.",
  "radio.receiveString": "Читает следующий пакет из очереди радиоканала и возвращает строковые полезные\nданные пакета или пустую строку, если пакет не содержит строки.",
  "radio.receivedBuffer": "Возвращает полезную нагрузку буфера из последнего пакета, взятого из очереди радиоканала\n(посредством «receiveNumber», «receiveString» и т. д.) или пустую строку, если\nэтот пакет не содержит строку.",
  "radio.receivedSignalStrength": "Получает индикатор уровня принимаемого сигнала (RSSI) из последнего пакета,\nполученного из очереди радиоканала (посредством «receiveNumber», «receiveString» и т. д.). В симуляторе не поддерживается.\nпространство имен=radio",
  "radio.sendBuffer": "Передает буфер (длиной до 19 байт) вместе с серийным номером устройства\nи временем выполнения всем подключенным устройствам micro:bit в группе.",
  "radio.sendNumber": "Передает число по радиоканалу всем подключенным устройствам micro:bit в группе.",
  "radio.sendString": "Передает строку вместе с серийным номером устройства\nи временем выполнения всем подключенным устройствам micro:bit в группе.",
  "radio.sendValue": "Передает пару «имя — значение» вместе с серийным номером устройства\nи временем выполнения всем подключенным устройствам micro:bit в группе.",
  "radio.sendValue|param|name": "имя поля (не более 12 символов), например: «имя»",
  "radio.sendValue|param|value": "числовое значение",
  "radio.setGroup": "Задает идентификатор группы для радиосвязи. Устройство micro:bit может прослушивать только один идентификатор группы в данное время.",
  "radio.setGroup|param|id": "идентификатор группы, от «0» до «255», например: 1",
  "radio.setTransmitPower": "Изменить уровень выходной мощности передатчика на заданное значение.",
  "radio.setTransmitPower|param|power": "значение в диапазоне 0…7, где 0 — наименьшая мощность, а 7 — наибольшая. Например: 7",
  "radio.setTransmitSerialNumber": "Устанавливает радиоканал на передачу серийного номера в каждом сообщении.",
  "radio.setTransmitSerialNumber|param|transmit": "значение, указывающее, передается ли серийный номер, например: истина",
  "radio.writeReceivedPacketToSerial": "Записывает последний полученный пакет в последовательный порт как JSON.\n Это следует вызывать в обратном вызове «onDataPacketReceived».",
  "radio.writeValueToSerial": "Читает следующий пакет из очереди радиоканала и записывает его\nв последовательный порт как JSON."
}