{
  "radio": "Передача даних за допомогою радіопакетів",
  "radio.Packet.receivedNumber": "Числові корисні дані, якщо у цьому пакеті було надіслано число через \"sendNumber()\" або \"sendValue()\") \nабо 0, якщо це пакет не містить чисел.",
  "radio.Packet.receivedString": "Рядкові корисні дані, якщо у цьому пакеті було надіслано рядок (через \"sendString()\" або \"sendValue()\")\nабо пустий рядок, якщо пакет не містить рядка.",
  "radio.Packet.serial": "Серійний номер відправника пакета або 0, якщо відправником не було передано серійний номер.",
  "radio.Packet.signal": "Індикатор рівня отримуваного сигналу (RSSI) для пакета.",
  "radio.Packet.time": "Системний час відправника пакета на момент надсилання пакета.",
  "radio.onDataReceived": "Реєструє код, який запускається під час отримання пакета через радіосигнал.",
  "radio.receiveNumber": "Зчитує наступний пакет з черги радіоканалу та повертає числові корисні дані пакета або 0, якщо пакет не містить чисел.",
  "radio.receiveString": "Зчитує наступний пакет з черги радіоканалу та повертає рядкові корисні дані пакета або пустий рядок, якщо пакет не містить рядків.",
  "radio.receivedSignalStrength": "Отримує індикатор рівня отримуваного сигналу (RSSI) з останнього пакета, отриманого з черги радіоканалу (через \"receiveNumber\", \"receiveString\" і т. д.). Не підтримується у симуляторі.\nnamespace=radio",
  "radio.sendNumber": "Передає число за допомогою радіоканалу на всі підключені пристрої micro:bit у групі.",
  "radio.sendString": "Передає рядок разом з серійним номером пристрою\nта часом виконання на всі підключені пристрої micro:bit у групі.",
  "radio.sendValue": "Передає пару \"рядок-значення\" разом з серійним номером пристрою\nта часом виконання на всі підключені пристрої micro:bit у групі.",
  "radio.sendValue|param|name": "ім'я поля (не більше 12 символів) - наприклад, \"ім'я\"",
  "radio.sendValue|param|value": "числове значення",
  "radio.setGroup": "Задає ідентифікатор групи для радіо зв'язку. Пристрій micro:bit може прослуховувати тільки один ідентифікатор групи за раз.",
  "radio.setGroup|param|id": "ідентифікатор групи, від 0 до 255 (наприклад, 1)",
  "radio.setTransmitPower": "Змінити рівень вихідної потужності трансмітера на задане значення.",
  "radio.setTransmitPower|param|power": "значення у діапазоні від 0 до 7, де 0 — найменша потужність, а 7 — найвища (наприклад, 7)",
  "radio.setTransmitSerialNumber": "Встановлює радіоканал на передачу серійного номера у кожному повідомленні.",
  "radio.setTransmitSerialNumber|param|transmit": "значення, що показує, чи передається серійний номер (наприклад, true)",
  "radio.writeReceivedPacketToSerial": "Записує останній отриманий пакет у послідовний порт як JSON. Це потрібно викликати\nу зворотному виклику \"onDataPacketReceived\".",
  "radio.writeValueToSerial": "Зчитує наступний пакет з черги радіоканалу та записує його у послідовний порт як JSON."
}