{
  "radio": "Komunikasikan data menggunakan paket radio",
  "radio.Packet.receivedNumber": "Jumlah muatan jika suatu angka dikirim di dalam paket ini (melalui ``sendNumber()`` atau ``sendValue()``)\natau 0 jika paket ini tidak berisi suatu angka.",
  "radio.Packet.receivedString": "Muatan untai jika suatu untai dikirimkan dalam paket ini (melalui ``sendString()`` atau ``sendValue()``)\natau untai kosong jika paket ini tidak berisi suatu untai.",
  "radio.Packet.serial": "Angka serial pengirim paket atau 0 jika pengirim tidak mengirimkan angka serialnya.",
  "radio.Packet.signal": "Indikator kekuatan sinyal yang diterima (RSSI) paket.",
  "radio.Packet.time": "Waktu sistem pengirim paket pada saat paket dikirimkan.",
  "radio.onDataReceived": "Mendaftarkan kode untuk dijalankan saat suatu paket diterima melalui radio.",
  "radio.receiveNumber": "Membaca paket berikutnya dari antrean radio dan mengembalikan muatan\nangka paket atau 0 jika paket tidak berisi suatu angka.",
  "radio.receiveString": "Membaca paket berikutnya dari antrean radio dan mengembalikan muatan\nuntai paket atau kosong jika paket tidak berisi suatu untai.",
  "radio.receivedSignalStrength": "Mendapatkan indikator kekuatan sinyal yang diterima (RSSI) dari paket terakhir yang diambil\ndari antrean radio (melalui ``receiveNumber``, ``receiveString``, dll.). Tidak didukung di dalam simulator.\nnamespace=radio",
  "radio.sendNumber": "Menyiarkan suatu angka lewat radio ke micro:bit apa pun yang terkoneksi di dalam grup.",
  "radio.sendString": "Menyiarkan suatu untai bersama dengan angka serial perangkat\ndan waktu aktif ke micro:bit apa pun yang terkoneksi di dalam grup.",
  "radio.sendValue": "Menyiarkan suatu nama / nilai bersama dengan angka serial perangkat\ndan waktu aktif ke micro:bit apa pun yang terkoneksi di dalam grup.",
  "radio.sendValue|param|name": "nama bidang (maks. 12 karakter), cth: \"nama\"",
  "radio.sendValue|param|value": "nilai numerik",
  "radio.setGroup": "Menetapkan id grup untuk komunikasi radio. Satu micro:bit hanya dapat mendengarkan satu ID grup kapan pun.",
  "radio.setGroup|param|id": "id grup antara ``0`` hingga ``255``, cth: 1",
  "radio.setTransmitPower": "Ubah tingkat daya output pemancar ke nilai tertentu.",
  "radio.setTransmitPower|param|power": "suatu nilai dalam kisaran 0..7, di mana 0 adalah kekuatan terendah dan 7 adalah yang tertinggi. cth: 7",
  "radio.setTransmitSerialNumber": "Atur radio untuk mentransmisikan angka serial dalam setiap pesan.",
  "radio.setTransmitSerialNumber|param|transmit": "nilai yang mengindikasikan jika angka serial ditransmisikan, cth: benar",
  "radio.writeReceivedPacketToSerial": "Menulis paket terakhir yang diterima ke serial sebagai JSON. Ini harus dipanggil\ndalam suatu panggilan-kembali ``onDataPacketReceived``.",
  "radio.writeValueToSerial": "Membaca paket selanjutnya dari antrean radio dan menulisnya ke serial\nsebagai JSON."
}