{
  "radio": "Posílá data s použitím radiových paketů",
  "radio.Packet.receivedNumber": "Číslo datové části, pokud bylo číslo odeslané v tomto paketu (přes ``sendNumber()``nebo ``sendValue()``) nebo 0, pokud tento paket neobsahoval číslo.",
  "radio.Packet.receivedString": "Datová část řetězce, pokud byl řetězec odeslán v tomto paketu (přes ``sendString()`` nebo ``sendValue()``) nebo prázdný řetězec, pokud tento balíček neobsahoval řetězec.",
  "radio.Packet.serial": "Sériové číslo odesílatele paketu nebo 0, pokud odesílatel neodeslal své sériové číslo.",
  "radio.Packet.signal": "Přijatý indikátor síly signálu (RSSI) paketu.",
  "radio.Packet.time": "Systémový čas odesílatele paketu v době, kdy byl paket odeslán.",
  "radio.onDataReceived": "Registruje program ke spuštění při přijetí paketu přes rádiový signál.",
  "radio.receiveNumber": "Přečte další paket v pořadí rádiového signálu a vrátí číslo datové části paketu nebo 0, pokud paket neobsahuje žádné číslo.",
  "radio.receiveString": "Přečte další paket v rádiové řadě a vrátí veškeré řetězce z paketu nebo prázdný řetězec, pokud paket žádný řetězec neobsahoval.",
  "radio.receivedSignalStrength": "Získá indikátor síly přijatého signálu (RSSI) z posledního paketu získaného z rádiové řady (přes ``receiveNumber``, ``receiveString`` atd.). Není podporováno v simulátoru.\nnamespace=radio",
  "radio.sendNumber": "Vysílá číslo přes rádio do jakéhokoliv micro:bitu připojeného ve skupině.",
  "radio.sendString": "Vysílá řetězec spolu se sériovým číslem zařízení a dobou běhu na jakýkoliv micro:bit připojený ve skupině.",
  "radio.sendValue": "Vysílá kombinaci název / hodnota spolu se sériovým číslem zařízení a dobou běhu na jakýkoliv mikro:bit připojený ve skupině.",
  "radio.sendValue|param|name": "název pole (maximálně 12 znaků), např.: \"jméno\"",
  "radio.sendValue|param|value": "číselná hodnota",
  "radio.setGroup": "Nastaví id skupiny pro rádiovou komunikaci. Micro:bit může vždy poslouchat pouze jedno ID skupiny.",
  "radio.setGroup|param|id": "id skupiny mezi ''0'' a ''255'', např.: 1",
  "radio.setTransmitPower": "Změní výstupní výkon vysílače na danou hodnotu.",
  "radio.setTransmitPower|param|power": "hodnota v rozsahu 0..7, kde 0 je nejnižší výkon a 7 je nejvyšší. např.: 7",
  "radio.setTransmitSerialNumber": "Nastavit rádio tak, aby v každé zprávě vysílalo sériové číslo.",
  "radio.setTransmitSerialNumber|param|transmit": "hodnota ukazující, zda je vysíláno sériové číslo, např: pravda",
  "radio.writeReceivedPacketToSerial": "Zapíše poslední přijatý paket do série jako JSON. To by měla být vyvoláno v rámci ``onDataPacketReceived`` zpětného volání.",
  "radio.writeValueToSerial": "Přečte další paket z rádiové řady a a zapíše jej do série jako JSON."
}