{
  "radio": "Viesti dataa käyttäen radiopaketteja",
  "radio.Packet.receivedNumber": "Luvun hyötykuorma, jos luku lähetettiin tässä paketissa (komennolla ``sendNumber()`` tai ``sendValue()``)\ntai 0, jos tämä paketti ei sisältänyt lukua.",
  "radio.Packet.receivedString": "Merkkijonon hyötykuorma, jos merkkijono lähetettiin tässä paketissa (komennolla ``sendNumber()`` tai ``sendValue()``)\ntai tyhjä merkkijono, jos tämä paketti ei sisältänyt merkkijonoa.",
  "radio.Packet.serial": "Paketin lähettäjän sarjanumero tai 0, jos lähettäjä ei lähettänyt sarjanumeroaan.",
  "radio.Packet.signal": "Paketin vastaanotettu signaalivoimakkuuden ilmaisin (RSSI).",
  "radio.Packet.time": "Lähettäjän järjestelmän aika paketin lähetyshetkellä.",
  "radio.onDataReceived": "Rekisteröi koodin, joka suoritetaan, kun paketti vastaanotetaan radioteitse.",
  "radio.receiveNumber": "Lukee radiojonon seuraavan paketin ja palauttaa paketin numeron tiedot tai 0, jos paketti ei sisältänyt numeroa.",
  "radio.receiveString": "Lukee radiojonon seuraavan paketin ja palauttaa paketin merkkijonon tiedot tai tyhjän merkkijonon, jos paketti ei sisältänyt merkkijonoa.",
  "radio.receivedSignalStrength": "Hakee vastaanoton signaalivoimakkuuden ilmaisimen (RSSI) viimeisimmästä radiojonosta otetusta paketista (käyttämällä komentoa ``receiveNumber``, ``receiveString``, jne.). Ei tueta simulaattorissa.",
  "radio.sendNumber": "Lähettää numeron radioteitse mihin tahansa ryhmän yhdistettyyn micro:bitiin.",
  "radio.sendString": "Lähettää merkkijonon sekä laitteen sarjanumeron ja suoritusajan mihin tahansa ryhmän yhdistettyyn micro:bitiin.",
  "radio.sendValue": "Lähettää nimi/arvoparin sekä laitteen sarjanumeron ja suoritusajan mihin tahansa ryhmän yhdistettyyn micro:bitiin.",
  "radio.sendValue|param|name": "kentän nimi (enintään 12 merkkiä), esim: ”nimi”",
  "radio.sendValue|param|value": "lukuarvo",
  "radio.setGroup": "Määrittää ryhmän tunnuksen radioviestintää varten. Yksi micro:bit voi kuunnella vain yhtä ryhmän tunnusta kerralla.",
  "radio.setGroup|param|id": "ryhmän tunnus välillä ``0`` – ``255``, esim: 1",
  "radio.setTransmitPower": "Vaihtaa lähettimen lähtötehon annettuun arvoon.",
  "radio.setTransmitPower|param|power": "arvo välillä 0..7, jossa 0 on matalin teho ja 7 on korkein, esim: 7",
  "radio.setTransmitSerialNumber": "Määrtäradion lähettämään sarjanumero jokaisessa viestissä.",
  "radio.setTransmitSerialNumber|param|transmit": "arvo, joka ilmaisee lähetetäänkö sarjanumero, esim: tosi",
  "radio.writeReceivedPacketToSerial": "Kirjoittaa viimeisimmän vastaanotetun paketin sarjaan JSON-muodossa. Tätä tulisi kutsua ``onDataPacketReceived``-vastakutsussa.",
  "radio.writeValueToSerial": "Lukee radiojonon seuraavan paketin ja kirjoittaa sen sarjaan JSON-muodossa."
}