{
  "radio": "Comunicar datos usando paquetes de radio",
  "radio.Packet.receivedNumber": "La carga del número si un número fue enviado en este paquete (a través de ``sendNumber()`` o ``sendValue()``)\no 0 si este paquete no contenía ningún número.",
  "radio.Packet.receivedString": "La carga de la cadena si una cadena fue enviada en este paquete (a través de ``sendString()`` o ``sendValue()``)\no cadena vacía si este paquete no contenía ninguna cadena.",
  "radio.Packet.serial": "El número de serie del emisor del paquete o 0 si el emisor no envió su número de serie.",
  "radio.Packet.signal": "El indicador de intensidad de señal recibida (RSSI) del paquete.",
  "radio.Packet.time": "La hora del sistema del emisor del paquete en el momento de envío del paquete.",
  "radio.onDataReceived": "Registra código a ejecutar cuando se recibe un paquete por radio.",
  "radio.receiveNumber": "Lee el siguiente paquete de la cola de radio y devuelve el número recibido en el paquete o 0 si el paquete no contenía un número.",
  "radio.receiveString": "Lee el siguiente paquete de la cola de radio y devuelve la cadena recibida en el paquete o una cadena vacía si el paquete no contenía una cadena.",
  "radio.receivedSignalStrength": "Obtiene el indicador de intensidad de señal recibida (RSSI) del último paquete obtenido de la cola de radio (a través de \"receiveNumber\", \"receiveString\", etc). No disponible en el simulador.\nnamespace=radio",
  "radio.sendNumber": "Emite un número por radio a cualquier micro:bit conectado en el grupo.",
  "radio.sendString": "Emite en una cadena junto con el número de serie del dispositivo \ny el tiempo de ejecución a cualquier micro:bit conectado en el grupo.",
  "radio.sendValue": "Emite un par de nombre / valor junto con el número de serie del dispositivo y el tiempo de ejecución a cualquier micro:bit conectado en el grupo.",
  "radio.sendValue|param|name": "el nombre del campo (máximo 12 caracteres), por ej.: \"nombre\"",
  "radio.sendValue|param|value": "el valor de numérico",
  "radio.setGroup": "Establece el id de grupo para comunicaciones por radio. Un micro:bit sólo puede escuchar a un ID de grupo por vez.",
  "radio.setGroup|param|id": "el id de grupo entre \"0\" y \"255\", por ej.: 1",
  "radio.setTransmitPower": "Cambiar el nivel de potencia de salida del transmisor al valor especificado.",
  "radio.setTransmitPower|param|power": "un valor en el rango de 0..7, donde 0 es la potencia más baja y 7 es la más alta. por ej.: 7",
  "radio.setTransmitSerialNumber": "Establece que la radio transmita el número de serie en cada mensaje.",
  "radio.setTransmitSerialNumber|param|transmit": "valor que indica si el número de serie se transmite, por ej.: verdadero",
  "radio.writeReceivedPacketToSerial": "Escribe el último paquete recibido a serial como JSON. Debe ejecutarse desde una retrollamada de \"onDataPacketReceived\".",
  "radio.writeValueToSerial": "Lee el siguiente paquete de la cola de radio y lo escribe a serial como JSON."
}