{
  "radio": "Kommuniker data ved hjælp af radiopakker",
  "radio.Packet.receivedNumber": "Nummerdataene, hvis et nummer blev sendt i denne pakke (via ``sendNumber()`` eller ``sendValue()``)\neller 0, hvis pakken ikke indeholder et nummer.",
  "radio.Packet.receivedString": "Strengdataene, hvis en streng blev sendt i denne pakke (via ``sendString()`` eller ``sendValue()``)\neller den tomme streng, hvis denne pakke ikke indeholder en streng.",
  "radio.Packet.serial": "Serienummeret for pakkens afsender eller 0, hvis afsenderen ikke sendte deres serienummer.",
  "radio.Packet.signal": "Indikator for modtaget signalstyrke (RSSI) for pakken.",
  "radio.Packet.time": "Systemtiden for pakkens afsender på det tidspunkt, hvor pakken blev sendt.",
  "radio.onDataPacketReceived": "Registrerer kode, der skal køre, når radioen modtager en pakke. Tager desuden den modtagede pakke fra radiokøen.",
  "radio.onDataReceived": "Registrerer kode, der skal køre, når en pakke modtages over radioen.",
  "radio.receiveNumber": "Læser den nye pakke fra radiokøen og returnerer pakkens nummerdata eller 0, hvis pakken ikke indeholder et nummer.",
  "radio.receiveString": "Læser den nye pakke fra radiokøen og returnerer pakkens strengdata eller den tomme streng, hvis pakken ikke indeholder en streng.",
  "radio.receivedNumber": "Returnerer nummerdataene fra den sidste pakke, der blev taget fra radiokøen (via ``receiveNumber``, ``receiveString`` osv.) eller 0, hvis pakken ikke indeholder et nummer.",
  "radio.receivedSerial": "Returnerer serienummeret på sender micro:bit fra den sidste pakke, der blev taget fra radiokøen (via ``receiveNumber``, ``receiveString`` osv.) eller 0, hvis pakken ikke sender et serienummer.",
  "radio.receivedSignalStrength": "Henter den modtagede signalstyrkeindikator (RSSI) fra den sidste pakke, der blev taget fra radiokøen (via ``receiveNumber``, ``receiveString`` osv.). Understøttes ikke i simulatoren.\nnamespace=radio",
  "radio.receivedString": "Returnerer strengdataene fra den sidste pakke, der blev taget fra radiokøen (via ``receiveNumber``, ``receiveString`` osv.) eller den tomme streng, hvis den pakke ikke indeholder en streng.",
  "radio.receivedTime": "Returnerer systemtiden for sender micro:bit det øjeblik, hvor den sendte den sidste pakke, der blev taget fra radiokøen (via ``receiveNumber``,\n``receiveString`` osv.).",
  "radio.sendNumber": "Udsender et nummer over radioen til alle tilsluttede micro:bit i gruppen.",
  "radio.sendString": "Udsender en streng sammen med enhedens serienummer\nog køretid til alle tilsluttede micro:bit i gruppen.",
  "radio.sendValue": "Udsender et navn/værdi-par sammen med enhedens serienummer\nog køretid til alle tilsluttede micro:bit i gruppen.",
  "radio.sendValue|param|name": "feltnavnet (maks. 12 tegn), fx: \"navn\"",
  "radio.sendValue|param|value": "den numeriske værdi",
  "radio.setGroup": "Indstiller gruppe-id'et til radiokommunikation. En micro:bit kan kun lytte til ét gruppe-id ad gangen.",
  "radio.setGroup|param|id": "gruppe-id'et mellem ``0`` og ``255``, fx: 1",
  "radio.setTransmitPower": "Ændr senderens effektniveau til den givne værdi.",
  "radio.setTransmitPower|param|power": "en værdi i intervallet 0..7, hvor 0 er den laveste effekt, og 7 er den højeste. fx: 7",
  "radio.setTransmitSerialNumber": "Indstiller radioen til at sende serienummeret i hver meddelelse.",
  "radio.setTransmitSerialNumber|param|transmit": "værdi, der angiver, om serienummeret sendes, fx: sand",
  "radio.writeReceivedPacketToSerial": "Skriver den sidst modtagede pakke til seriel som JSON. Dette bør angives i et ``onDataPacketReceived`` tilbagekald.",
  "radio.writeValueToSerial": "Læser den næste pakke fra radiokøen og skriver den til seriel som JSON."
}