{
  "radio": "Комуникиране на данни с помощта на радио пакети",
  "radio.Packet.receivedNumber": "Полезният обем на числото, ако числото е изпратено в този пакет (чрез ``sendNumber()`` или ``sendValue()``)\nили 0, ако този пакет не е съдържал число.",
  "radio.Packet.receivedString": "Полезният обем на низ, ако низът е изпратен в този пакет (чрез ``sendString()`` или ``sendValue()``)\nили празния низ, ако този пакет не е съдържал низ.",
  "radio.Packet.serial": "Серийният номер на изпращача на пакета или 0, ако изпращачът не е изпратил своя сериен номер.",
  "radio.Packet.signal": "Полученият индикатор за сила на сигнала (RSSI) на пакета.",
  "radio.Packet.time": "Времето на системата на изпращача на пакета в момента на изпращане на пакета.",
  "radio.onDataPacketReceived": "Регистрира код за стартиране, когато радиото получи пакет. Също така поема получения пакет от радио опашката.",
  "radio.onDataReceived": "Регистрира код за стартиране, когато пакетът е получен чрез радио.",
  "radio.receiveNumber": "Разчита следващия пакет от радио опашката и връща полезния обем на число на пакета или 0, ако пакетът не е съдържал число.",
  "radio.receiveString": "Разчита следващия пакет от радио опашката и връща полезния обем на низ на пакета или празния низ, ако пакетът не е съдържал низ.",
  "radio.receivedNumber": "Връща полезния обем на числото от последния пакет, поет от радио опашката\n(чрез ``receiveNumber``, ``receiveString`` и т. н.) или 0, ако този пакет не е съдържал число.",
  "radio.receivedSerial": "Връща серийния номер на изпращача micro:bit от последния пакет, поет от радио опашката (чрез ``receiveNumber``, ``receiveString`` и т.н.) или 0, ако този пакет не е изпратил сериен номер.",
  "radio.receivedSignalStrength": "Получава получения индикатор за сила на сигнала (RSSI) от последния пакет, взет от радио опашката (чрез ``receiveNumber``, ``receiveString`` и т. н.). Не се поддържа в симулатора.\nnamespace=radio",
  "radio.receivedString": "Връща полезния обем на низа от последния пакет, поет от радио опашката\n(чрез ``receiveNumber``, ``receiveString`` и т. н.) или празния пакет, ако този пакет не е съдържал низ.",
  "radio.receivedTime": "Връща системното време на изпращача micro:bit в момента, когато е изпратил последния пакет, поет от радио опашката (чрез ``receiveNumber``,\n``receiveString`` и т.н.).",
  "radio.sendNumber": "Предава число по радио към всички свързани micro:bit в групата.",
  "radio.sendString": "Предава низ, заедно със серйния номер на устройството\nи времетраенето, към всички свързани micro:bit в групата.",
  "radio.sendValue": "Предава име / стойност на двойка, заедно със серийния номер на устройството\nи времетраенето към всички свързани micro:bit в групата.",
  "radio.sendValue|param|name": "името на полето (макс. 12 знака), напр.: „име“",
  "radio.sendValue|param|value": "цифровата стойност",
  "radio.setGroup": "Задава груповото id за радио комуникации. micro:bit може да слуша само едно ID на група във всеки момент.",
  "radio.setGroup|param|id": "id на група между ``0`` и ``255``, напр.: 1",
  "radio.setTransmitPower": "Промяна на нивото на изходящото захранване на предавателя за дадената стойност.",
  "radio.setTransmitPower|param|power": "стойност в диапазона 0..7, където 0 е най-ниската степен, а 7 е най-високата, напр.: 7",
  "radio.setTransmitSerialNumber": "Задаване на радиото за предаване на серийния номер за всяко съобщение.",
  "radio.setTransmitSerialNumber|param|transmit": "стойност, указваща дали серийният номер се предава, напр.: вярно",
  "radio.writeReceivedPacketToSerial": "Записва последния получен пакет към серията като JSON. Това трябва да се извика\nв рамките на обратно повикване ``onDataPacketReceived``.",
  "radio.writeValueToSerial": "Разчита следващия пакет от радио опашката и го записва към серията\nкато JSON."
}