{
  "radio": "Επικοινωνία δεδομένων χρησιμοποιώντας ραδιοφωνικά πακέτα",
  "radio.Packet.receivedNumber": "Ο αριθμός φορτίου εάν στάλθηκε αριθμός σε αυτό το πακέτο (μέσω``sendNumber()`` ή``sendValue()``)\nή 0 εάν το πακέτο δεν περιείχε αριθμό.",
  "radio.Packet.receivedString": "Ο αριθμός φορτίου εάν στάλθηκε αριθμός σε αυτό το πακέτο (μέσω``sendString()`` ή ``sendValue()``)\nή άδεια συμβολοσειρά εάν το πακέτο δεν περιείχε αριθμό.",
  "radio.Packet.serial": "Ο σειριακός αριθμός του αποστολέα του πακέτου ή 0 εάν ο αποστολέας δεν έστειλε τον σειριακό αριθμό του.",
  "radio.Packet.signal": "Η ληφθείσα ένδειξη ισχύος σήματος (RSSI) του πακέτου.",
  "radio.Packet.time": "H ώρα του συστήματος του αποστολέα του πακέτου κατά την αποστολή του πακέτου.",
  "radio.onDataReceived": "Καταχωρεί κώδικα που θα εκτελεστεί όταν γίνει λήψη πακέτου μέσω ραδιοφώνου.",
  "radio.receiveNumber": "Διαβάζει το επόμενο πακέτο από την ουρά του ραδιοφώνου και επιστρέφει τον αριθμό του φορτίου του πακέτου\nή 0 εάν το πακέτο δεν περιείχε αριθμό.",
  "radio.receiveString": "Διαβάζει το επόμενο πακέτο από την ουρά του ραδιοφώνου και επιστρέφει τη συμβολοσειρά του φορτίου του πακέτου ή άδεια συμβολοσειρά εάν το πακέτο δεν περιείχε συμβολοσειρά.",
  "radio.receivedSignalStrength": "Λαμβάνει την ένδειξη ισχύος του ληφθέντος σήματος (RSSI) από το τελευταίο πακέτο στην ουρά του ραδιοφώνου (μέσω ``receiveNumber``, ``receiveString``, κλπ). Δεν υποστηρίζεται στον εξομοιωτή.\nnamespace=radio",
  "radio.sendNumber": "Εκπέμπει ένα αριθμό μέσω του ραδιοφώνου σε οποιοδήποτε συνδεδεμένο micro:bit στην ομάδα.",
  "radio.sendString": "Μεταδίδει μια συμβολοσειρά μαζί με το σειριακό αριθμό της συσκευής και το χρόνο λειτουργίας σε οποιοδήποτε συνδεδεμένο micro:bit στην ομάδα.",
  "radio.sendValue": "Μεταδίδει ένα ζευγάρι όνομα/τιμή μαζί με το σειριακό αριθμό της συσκευής και το χρόνο λειτουργίας σε οποιοδήποτε συνδεδεμένο micro:bit στην ομάδα.",
  "radio.sendValue|param|name": "το όνομα του πεδίου (μέγιστο 12 χαρακτήρες), π.χ.: \"name\"",
  "radio.sendValue|param|value": "η αριθμητική αξία",
  "radio.setGroup": "Ορίζει το ομαδικό id των ραδιοφωνικών επικοινωνιών. Το micro:bit ακούει μόνο ένα ομαδικό ID κάθε φορά.",
  "radio.setGroup|param|id": "το ομαδικό id από ``0`` έως``255``, π.χ.: 1",
  "radio.setTransmitPower": "Αλλαγή στάθμης ισχύος εξόδου του πομπού στη δεδομένη τιμή.",
  "radio.setTransmitPower|param|power": "μια τιμή στην κλίμακα 0..7, όπου 0 είναι η χαμηλότερη ισχύς και 7 είναι η υψηλότερη. π.χ.: 7",
  "radio.setTransmitSerialNumber": "Ορίζει το ραδιόφωνο που θα μεταδώσει το σειριακό αριθμό στο κάθε μήνυμα.",
  "radio.setTransmitSerialNumber|param|transmit": "τιμή που δηλώνει εάν έχει μεταδωθεί ο σειριακός αριθμός, π.χ.: true",
  "radio.writeReceivedPacketToSerial": "Γράφει το τελευταία ληφθέν πακέτο στη σειριακή ως αρχείο JSON. Το συγκεκριμένο πρέπει να καλείται με εντολή callback ``onDataPacketReceived``.",
  "radio.writeValueToSerial": "Διαβάζει το επόμενο πακέτο από την ουρά του ραδιοφώνου και το γράφει στη σειριακή ως αρχείο JSON."
}