{
  "radio": "Kommunicera data med hjälp av radiopaket",
  "radio.Packet.receivedNumber": "Numrets nyttolast om ett nummer skickades i det här paketet (via ``sendNumber()`` eller ``sendValue()``)\neller 0 om det här paketet inte innehöll ett nummer.",
  "radio.Packet.receivedString": "Strängens nyttolast om en sträng skickades i det här paketet (via ``sendString()`` eller ``sendValue()``)\neller den tomma strängen om det här paketet inte innehöll en sträng.",
  "radio.Packet.serial": "Serienumret till paketets avsändare eller 0 om avsändaren inte har skickat sitt serienummer.",
  "radio.Packet.signal": "Mottagen signalstyrka (RSSI) för paketet.",
  "radio.Packet.time": "Systemtid för paketets avsändare vid tidpunkten då paketet skickades.",
  "radio.onDataPacketReceived": "Registrerar kod att köra när radion tar emot ett paket. Tar också det mottagna paketet från radiokön.",
  "radio.onDataReceived": "Registrerar kod att köra när ett paket tas emot över radio.",
  "radio.receiveNumber": "Läser nästa paket från radio kön och returnerar numret som paketet innehåller eller 0 om paketet inte innehåller något nummer.",
  "radio.receiveString": "Läser nästa paket från radio kön och returnerar strängen som paketet innehåller eller en tom sträng om paketet inte innehåller någon sträng.",
  "radio.receivedSignalStrength": "Får den mottagna signalstyrka (RSSI) från senaste paketet från radio kön (via ``receiveNumber``, ``receiveString``, osv). Stöds inte i simulator.\nnamnområdet=radio",
  "radio.sendNumber": "Sänder ett tal över radio till ett anslutet micro:bit i gruppen.",
  "radio.sendString": "Sänder en sträng med enhetens serienummer och körtid till alla micro:bit som är anslutna i gruppen.",
  "radio.sendValue": "Sänder ett namn-/värdepar tillsammans med enhetens serienummer och körtid till alla micro:bit som är anslutna i gruppen.",
  "radio.sendValue|param|name": "fältet namn (max 12 tecken), t. ex.: ”namn”",
  "radio.sendValue|param|value": "det numeriska värdet",
  "radio.setGroup": "Anger grupp-ID för radiokommunikation. En micro:bit kan bara lyssna på ett grupp-ID i taget.",
  "radio.setGroup|param|id": "grupp-id mellan ``0`` och ``255``, t. ex: 1",
  "radio.setTransmitPower": "Ändra styrkan på uteffekten av sändaren till det angivna värdet.",
  "radio.setTransmitPower|param|power": "ett värde i intervallet 0..7, där 0 är den lägsta styrkan och 7 är den högsta. t.ex.: 7",
  "radio.setTransmitSerialNumber": "Ställ in så att radion sänder serienumret i varje meddelande.",
  "radio.setTransmitSerialNumber|param|transmit": "värde som anger om serienumret överfördes, t. ex.: sant",
  "radio.writeReceivedPacketToSerial": "Skriver det senast mottagna paketet till seriell som JSON. Detta ska anropas i en '' onDataPacketReceived''-callback.",
  "radio.writeValueToSerial": "Läser nästa paket från radio kön och och skriver det till seriell som JSON."
}