{
  "radio": "Komunikovať údaje s využitím rádiových paketov",
  "radio.Packet.receivedNumber": "Číselná údajová časť, ak sa v tomto palete odoslalo číslo (prostredníctvom funkcií \"sendNumber()\" alebo \"sendValue()\"),\nalebo 0, ak paket číslo neobsahoval.",
  "radio.Packet.receivedString": "Reťazcová údajová časť, ak sa v tomto palete odoslal reťazec (prostredníctvom funkcií \"sendString()\" alebo \"sendValue()\"),\nalebo prázdny reťazec, ak paket reťazec neobsahoval.",
  "radio.Packet.serial": "Sériové číslo odosielateľa paketu alebo, ak odosielateľ neodoslal svoje sériové číslo, 0.",
  "radio.Packet.signal": "Indikátor sily prijatého signálu (RSSI) paketu.",
  "radio.Packet.time": "Systémový čas odosielateľa paketu v čase odoslania paketu.",
  "radio.onDataReceived": "Kód registrov na spustenie, keď sa paket prijme prostredníctvom rádia.",
  "radio.receiveNumber": "Prečíta ďalší paket z fronty rádia a vráti číselnú údajovú časť paketu\nalebo 0, ak paket neobsahoval číslo.",
  "radio.receiveString": "Prečíta ďalší paket z fronty rádia a vráti reťazcovú údajovú časť paketu\nalebo 0, ak paket neobsahoval reťazec.",
  "radio.receivedSignalStrength": "Načíta indikátor sily prijatého signálu (RSSI) naposledy prijatého paketu načítaného\nz fronty rádia (prostredníctvom \"receiveNumber\", \"receiveString\" a pod.). V simulátore sa nepodporuje.\nnamespace=radio",
  "radio.sendNumber": "Prostredníctvom rádia vysiela číslo všetkým pripojeným zariadeniam micro:bit v skupine.",
  "radio.sendString": "Vysiela reťazec spolu so sériovým číslom zariadenia\na časom prevádzky všetkým pripojeným zariadeniam micro:bit v skupine.",
  "radio.sendValue": "Vysiela dvojicu názov/hodnota spolu so sériovým číslom zariadenia\na časom prevádzky všetkým pripojeným zariadeniam micro:bit v skupine.",
  "radio.sendValue|param|name": "názov poľa (12 znakov), napr. \"názov\"",
  "radio.sendValue|param|value": "číselná hodnota",
  "radio.setGroup": "Nastaví ID skupiny pre rádiovú komunikáciu. micro:bit môže načúvať len jedno ID skupiny súčasne.",
  "radio.setGroup|param|id": "ID skupiny od 0 do 255, napr. 1",
  "radio.setTransmitPower": "Zmeniť hladinu výstupného výkonu vysielača na zadanú hodnotu.",
  "radio.setTransmitPower|param|power": "hodnota v rozsahu 0..7, kde 0 predstavuje najnižší výkon a 7 najvyšší. Napr. 7",
  "radio.setTransmitSerialNumber": "Nastaví rádio na vysielanie sériového čísla v každej správe.",
  "radio.setTransmitSerialNumber|param|transmit": "hodnota vyjadrujúca, či sa vysiela sériové číslo, napr. pravda",
  "radio.writeReceivedPacketToSerial": "Zapíše naposledy prijatý paket na sériové zariadenie ako JSON. To je potrebné volať\nv rámci spätného volania \"onDataPacketReceived\" (keď je prijatý dátový paket).",
  "radio.writeValueToSerial": "Načíta ďalší paket z rádiovej fronty a zapíše ho na sériové zariadenie\nako JSON."
}