{
  "radio": "تبادل البيانات باستخدام حزم الراديو",
  "radio.Packet.receivedNumber": "حمل الرقم إذا تم إرسال رقم في هذه الحزمة (عن طريق ``sendNumber()`` أو ``sendValue()``)\nأو 0 إذا كانت هذه الحزمة لا تتضمن أي رقم.",
  "radio.Packet.receivedString": "حمل السلسلة إذا تم إرسال سلسلة إلى هذه الحزمة (عن طريق ``sendString()`` أو ``sendValue()``)\nأو سلسلة فارغة إذا كانت هذه الحزمة لا تحتوي على سلسلة.",
  "radio.Packet.serial": "الرقم المسلسل لمرسل الحزمة أو 0 إذا لم يرسل المرسل الرقم المسلسل له.",
  "radio.Packet.signal": "مؤشر قوة الإشارة المستلمة (RSSI) للحزمة.",
  "radio.Packet.time": "وقت النظام لمرسل الحزمة في وقت إرسال الحزمة.",
  "radio.onDataReceived": "يسجل التعليمة البرمجية لتشغيلها عند استلام حزمة عبر الراديو.",
  "radio.receiveNumber": "يقرأ الحزمة التالية من قائمة الراديو ويرجع حمولة رقم الحزمة أو 0 إذا كانت الحزمة لا تحتوي على رقم.",
  "radio.receiveString": "يقرأ الحزمة التالية من قائمة الراديو ويرجع حمولة سلسلة الحزمة أو سلسلة فارغة إذا كانت الحزمة لا تحتوي على سلسلة.",
  "radio.receivedSignalStrength": "يحصل على مؤشر قوة الإشارة المستلمة (RSSI) من رمز الحزمة الأخيرة\nمن قائمة الراديو (عن طريق ``receiveNumber`` أو ``receiveString`` أو غيره). غير مدعومة في أداة المحاكاة.\nnamespace=radio",
  "radio.sendNumber": "يبث رقمًا عبر الراديو إلى أي micro:bit متصل في المجموعة.",
  "radio.sendString": "يبث سلسلة إلى جانب الرقم التسلسلي للجهاز\nوزمن التشغيل إلى أي micro:bit متصل بالمجموعة.",
  "radio.sendValue": "يبث زوج اسم / قيمة الجهاز إلى جانب الرقم التسلسلي للجهاز\nوزمن التشغيل إلى أي micro:bit متصل في المجموعة.",
  "radio.sendValue|param|name": "اسم الحقل (بحد أقصى 12 حرفًا)، مثل: \"name\"",
  "radio.sendValue|param|value": "القيمة العددية",
  "radio.setGroup": "يضبط معرف المجموعة لاتصالات الراديو. يمكن لـ micro:bit الاستماع إلى معرف مجموعة واحد فقط في أي وقت.",
  "radio.setGroup|param|id": "معرف المجموعة بين ``0`` و ``255``، مثل: 1",
  "radio.setTransmitPower": "تغيير مستوى طاقة الإخراج لجهاز الإرسال إلى قيمة معينة.",
  "radio.setTransmitPower|param|power": "قيمة في نطاق 0..7، حيث يشير 0 إلى أدنى طاقة ويشير 7 إلى أقصى طاقة. مثال: 7",
  "radio.setTransmitSerialNumber": "تعيين الراديو على إرسال الرقم التسلسلي في كل رسالة.",
  "radio.setTransmitSerialNumber|param|transmit": "قيمة تشير إلى ما إذا تم إرسال الرقم التسلسلي، مثل: true",
  "radio.writeReceivedPacketToSerial": "يكتب آخر حزمة مستلمة إلى مسلسل مثل JSON. يجب استدعاء ذلك \nضمن رد اتصال ``onDataPacketReceived``.",
  "radio.writeValueToSerial": "يقرأ الحزمة التالية من قائمة الراديو وكتابتها إلى مسلسل مثل JSON."
}