{
  "radio": "Comunicar dados através de pacotes de rádio",
  "radio.Packet.receivedNumber": "O número de carga útil se um número foi enviado neste pacote (via ``sendNumber()`` ou ``sendValue()``) ou 0 se este pacote não contiver um número.",
  "radio.Packet.receivedString": "A carga útil da string se uma string foi enviada neste pacote (via ``SendString()`` ou ``sendValue()``) ou a string vazia se esse pacote não contiver uma string.",
  "radio.Packet.serial": "O número de série do remetente do pacote ou 0 se o remetente não enviou o seu número de série.",
  "radio.Packet.signal": "O indicador de força do sinal recebido (RSSI) do pacote.",
  "radio.Packet.time": "A hora do sistema do remetente do pacote no momento em que o pacote foi enviado.",
  "radio.onDataReceived": "Regista o código a executar quando for recebido um pacote por rádio.",
  "radio.receiveNumber": "Lê o próximo pacote na fila de rádio e devolve a carga útil do número do pacote ou 0 se o pacote não contiver um número.",
  "radio.receiveString": "Lê o próximo pacote na fila de rádio e devolve a carga útil da string do pacote ou a string vazia se o pacote não contiver uma string.",
  "radio.receivedSignalStrength": "Obtém o indicador de força do sinal recebido (RSSI) do último pacote retirado da fila de rádio (via ``receberNúmero``, ``receberString``, etc). Não suportado no simulador. namespace=radio",
  "radio.sendNumber": "Transmite um número através de rádio para qualquer micro:bit ligado no grupo.",
  "radio.sendString": "Transmite uma sequência juntamente com o número de série do dispositivo e o tempo de execução para qualquer micro:bit ligado no grupo.",
  "radio.sendValue": "Transmite um par nome / valor juntamente com o número de série do dispositivo e o tempo de execução para qualquer micro:bit ligado no grupo.",
  "radio.sendValue|param|name": "o nome do campo (máximos. 12 caracteres), por exemplo: \"nome\"",
  "radio.sendValue|param|value": "o valor numérico",
  "radio.setGroup": "Define o id de grupo para as comunicações de rádio. Um micro:bit só pode ouvir uma ID de grupo em qualquer altura.",
  "radio.setGroup|param|id": "a id de grupo entre ``0`` e ``255``, por exemplo: 1",
  "radio.setTransmitPower": "Alterar o nível de potência de saída do transmissor para determinado valor.",
  "radio.setTransmitPower|param|power": "um valor no intervalo 0..7, onde 0 é a potência mais baixa e 7 é a mais alta. por exemplo: 7",
  "radio.setTransmitSerialNumber": "Definir o rádio para transmitir o número de série em cada mensagem.",
  "radio.setTransmitSerialNumber|param|transmit": "valor que indica se o número de série é transmitido, por exemplo: verdadeiro",
  "radio.writeReceivedPacketToSerial": "Grava o último pacote recebido para serial como JSON. Deve ser chamado dentro de uma devolução de chamada ``onDataPacketReceived``.",
  "radio.writeValueToSerial": "Lê o próximo pacote da fila de rádio e e grava-o em série como JSON."
}